# numbers = [1, 2, 3, 4, 5]  # создаем лист и заполняем его элементами!
# print(type(numbers))  # Проверка типа данных листа!

# numbers1 = [] # Создаем пусты листы!
# numbers2 = list() # Создаем пусты листы!

# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]  # создаем лист и заполняем его элементами!
# numbers2 = list(numbers) # Создаем новый лист и записываем в него значение numbers
# numbers3 = numbers  # Создаем новый лист и записываем в него значение numbers ( АЛЬТЕРНАТИВНЫМ СПОСОБОМ )
# print(numbers)
# print(numbers2)
# print(numbers3)

# numbers = [1, 2, 3, 4, 5] # создаем лист и заполняем его элементами!
# print(numbers)
# print(numbers[4]) # Вычесление значения из листа с помощью индекса!

# numbers = [1, 5, 22, 21, 55, 12]
# print(numbers[4])

# numbers = [23, 43, 12, 95, 21, 55]  # создаем лист и заполняем его элементами!
# print(numbers)
# numbers[4] = 100  # Замещение значения в листе с помощью индекса!
# print(numbers)

# numbers = [5] * 6  # Клонирует значение в листе на то число которое умножает!
# print(numbers)

# numbers = list(range(5, 10))  # прогон от мин до макс ( от 5 до 10)
# print(numbers)

# objects = [1, 2.5, "привет", True, [1, 2, 3, 4], []]  # создание листа и наполнение его разными типами данных!
# print(objects)
# print(objects[4])  # ВЫвод значения из листа с помощью индекса!
